legacy/fsi-preparation/fluidCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          180;
        startFace       149772;
    }
    outlet
    {
        type            patch;
        nFaces          180;
        startFace       149952;
    }
    pipeWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          6816;
        startFace       150132;
    }
)

// ************************************************************************* //
