legacy/fsi-preparation/fluidCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

length          0.05;
radius          0.002;
coreHalf        0.001;
radiusNeg      -0.002;
coreHalfNeg    -0.001;

nR              6;
nX              284;

geometry
{
    pipe
    {
        type      cylinder;
        point1    (0       0 0);
        point2    ($length 0 0);
        radius    $radius;
    }
}

vertices
(
    (0       $coreHalfNeg $coreHalfNeg)
    (0       $coreHalf    $coreHalfNeg)
    (0       $coreHalfNeg $coreHalf)
    (0       $coreHalf    $coreHalf)

    project (0       $radiusNeg $radiusNeg) (pipe)
    project (0       $radius    $radiusNeg) (pipe)
    project (0       $radiusNeg $radius)    (pipe)
    project (0       $radius    $radius)    (pipe)

    ($length $coreHalfNeg $coreHalfNeg)
    ($length $coreHalf    $coreHalfNeg)
    ($length $coreHalfNeg $coreHalf)
    ($length $coreHalf    $coreHalf)

    project ($length $radiusNeg $radiusNeg) (pipe)
    project ($length $radius    $radiusNeg) (pipe)
    project ($length $radiusNeg $radius)    (pipe)
    project ($length $radius    $radius)    (pipe)
);

blocks
(
    hex (4 5 1 0 12 13 9 8)     ($nR $nR $nX) simpleGrading (1 1 1)
    hex (4 0 2 6 12 8 10 14)    ($nR $nR $nX) simpleGrading (1 1 1)
    hex (1 5 7 3 9 13 15 11)    ($nR $nR $nX) simpleGrading (1 1 1)
    hex (2 3 7 6 10 11 15 14)   ($nR $nR $nX) simpleGrading (1 1 1)
    hex (0 1 3 2 8 9 11 10)     ($nR $nR $nX) simpleGrading (1 1 1)
);

edges
(
    project 4 5   (pipe)
    project 5 7   (pipe)
    project 7 6   (pipe)
    project 6 4   (pipe)

    project 12 13 (pipe)
    project 13 15 (pipe)
    project 15 14 (pipe)
    project 14 12 (pipe)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (4 0 1 5)
            (4 6 2 0)
            (1 3 7 5)
            (2 6 7 3)
            (0 2 3 1)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (12 13 9 8)
            (12 8 10 14)
            (9 13 15 11)
            (10 11 15 14)
            (8 9 11 10)
        );
    }

    pipeWall
    {
        type wall;
        faces
        (
            (4 5 13 12)
            (4 12 14 6)
            (5 7 15 13)
            (6 14 15 7)
        );
    }
);

// ************************************************************************* //
