legacy/fsi-preparation/fluidCase/system/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// PHASE 3: DYNAMIC MESH CONFIGURATION FOR FSI COUPLING
// =====================================================
// 
// Enables the fluid mesh to deform in response to solid wall displacement.
// Used in two-way FSI coupling where wall movement affects the fluid domain.
// 
// Currently SET TO INACTIVE (false) - Enable when running full two-way FSI
// 
// To enable mesh morphing:
// 1. Run solid solver to compute displacement (D field)
// 2. Map displacement to fluid innerWall boundary
// 3. Set "dynamicFvMesh displacementLaplacian" below
// 4. Fluid solver will morph mesh each timestep

dynamicFvMesh   staticFvMesh;

// ============================================================================
// CONFIGURATION FOR MESH MORPHING (when enabled)
// ============================================================================
// Uncomment the following block to enable two-way FSI mesh deformation:
// 
//  dynamicFvMesh   displacementLaplacian;
//  
//  displacementLaplacianCoeffs
//  {
//      // Diffusivity type: harmonic prevents mesh tangling/skewness
//      diffusivity         harmonic 1.0;
//      
//      // Patches where displacement is prescribed (from solid deformation)
//      // These boundaries will move with the solid wall
//      diffusivityPatches  (pipeWall);
//      
//      // Patches with frozen motion (no displacement applied)
//      frozenPatches       (inlet outlet);
//      
//      // Elastic modulus scaling (prevents instability)
//      // Lower values (0.1-0.5) give smoother deformation
//      velocityScale       0.5;
//      
//      // Enable mesh quality control (prevents bad elements)
//      correctFluxes       false;
//  }

// ============================================================================
// MESH MORPHING STRATEGY
// ============================================================================
// 
// For two-way FSI, the workflow is:
// 
// 1. INITIALIZATION:
//    - Fluid mesh created (static)
//    - Solid mesh created (deformable)
//    - Meshes are conformal at inner wall interface
// 
// 2. COUPLING ITERATION:
//    a. Fluid solver runs
//       → Computes pressure field
//       → Pressure acts on innerWall boundary
//    
//    b. Solid solver runs
//       → Applies fluid pressure to innerWall BC
//       → Solves for wall displacement (D field)
//       → Outputs deformed geometry
//    
//    c. Mesh morphing (dynamicMesh)
//       → Reads displacement D from solidCase
//       → Maps displacement to fluid innerWall
//       → Uses displacementLaplacian to morph interior
//       → Interior points move smoothly (harmonic diffusion)
//    
//    d. Fluid solver runs again with deformed mesh
//       → Velocity profile changes (adapted to new radius)
//       → Pressure field updates
//       → Droplet transport affected by deformation
// 
// 3. CONVERGENCE CHECK:
//    - If displacement change < threshold → converged
//    - If not → iterate between solid and fluid again
// 
// ============================================================================
// TECHNICAL NOTES
// ============================================================================
// 
// A. Mesh Quality:
//    - Harmonic diffusivity preserves mesh quality best
//    - Skewness should remain < 0.8 after morphing
//    - If mesh becomes poor, remesh or reduce motion scale
// 
// B. Stability:
//    - velocityScale < 1.0 prevents overshooting
//    - Typical range: 0.3 - 0.7
//    - Smaller = smoother deformation, more iterations needed
// 
// C. Boundary Conditions:
//    - pipeWall: Active patch (follows solid displacement)
//    - inlet/outlet: Fixed (no axial deformation)
//    - Symmetry/empty: Standard conditions
// 
// D. Performance:
//    - Mesh morphing adds ~10-20% computational cost
//    - One-way coupling (current): fluid pressure → solid only
//    - Full two-way: adds mesh deformation feedback
// 
// ============================================================================
// REFERENCES
// ============================================================================
// 
// OpenFOAM Documentation:
//   - User Guide: dynamicFvMesh
//   - displacementLaplacian solver
//   - Mesh motion examples in tutorials/multiphase/
// 
// Theory:
//   - Radial expansion: Δr = Pr²/(Et)
//   - Mesh deformation preserves element connectivity
//   - Laplacian smoothing: ∇²(displacement) = 0 in interior
// 
// ============================================================================

// ============================================================================
// ONE-WAY COUPLING STATUS (CURRENT)
// ============================================================================
// 
// Currently implemented: One-way coupling only
//   Fluid pressure → Solid deformation ✓ (done)
//   Solid deformation → Fluid mesh   ✗ (requires dynamicMesh + morphing)
// 
// To complete two-way FSI:
// 1. Uncomment dynamicMeshDict block above
// 2. Run: foamRun -solver incompressibleVoF (will enable mesh motion)
// 3. Monitor mesh quality: foamCheckMesh fluidCase -time lastTime
// 4. Adjust velocityScale if needed
// 
// ============================================================================

// ============================================================================
// END OF DYNAMIC MESH CONFIGURATION
// ============================================================================

// eof
